# dance_list.py

import os
import django

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'dance_project.settings')
django.setup()

from engage.models import Dance

dance_names = [
    # Программа Зимнего бала ДВФУ 2025
    "Полонез",
    "Большой фигурный вальс",
    "Кадриль «Летучая мышь»",
    "Богемская полька",
    "Вальс «Огонек Свечи»",
    "КД «Три орешка для Золушки»",
    "Канон-галапад Кадриль",
    "Вальс «Паганини»",
    "Катильон с цветком",
    "Вальс «Нежность»",
    "Полька «Диабло»",
    "КД «Зимний Сон»",
    "Фри Массон",
    "Вальс «Сердце зимы»",
    "КД «Пожарники»",
    "Вальс «Графа Толстого»",
    "Ирландская полька",
    "Вальс «Катрин»",
    "Романи полька",
    "Вальс «Прогулка»",
    "Шотланский Вальс",
    "Бретонская линейная джига",
    "Вальс «Анастасия»",
    "КД «Русский Марш»",
    "БФ Вальс",
    "Вальс «Калейдоскоп»",
    "Вальс «Ветер с гор»",
    "КД «Роувелл»",
    "Вальс «Надежда»",
    "Блюз",
    "Вальс «Память»",
    "Порушка",
]

for name in dance_names:
    Dance.objects.get_or_create(name=name)

print("Танцы успешно добавлены!")
